request_toluca1.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://facturacion.finkok.com/cancel" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://facturacion.finkok.com/cancellation" xmlns:ins1="apps.services.soap.core.views"><env:Body><tns:cancel>  <tns:UUIDS>
    <tns:uuids>
      <tns:string>BAE85C8E-EC55-4EC5-A26E-2E0D5FADC658</tns:string>
    </tns:uuids>
  </tns:UUIDS>
  <tns:username>plataforma-dc@outlook.com</tns:username>
  <tns:password>Disen0s22_</tns:password>
  <tns:taxpayer_id>CAME810905HJ1</tns:taxpayer_id>
  <tns:cer>LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUdKakNDQkE2Z0F3SUJB
Z0lVTURBd01ERXdNREF3TURBME1EVTNOelV5TkRVd0RRWUpLb1pJaHZjTkFR
RUwKQlFBd2dnR3lNVGd3TmdZRFZRUUREQzlCTGtNdUlHUmxiQ0JUWlhKMmFX
TnBieUJrWlNCQlpHMXBibWx6ZEhKaApZMm5EczI0Z1ZISnBZblYwWVhKcFlU
RXZNQzBHQTFVRUNnd21VMlZ5ZG1samFXOGdaR1VnUVdSdGFXNXBjM1J5CllX
TnB3N051SUZSeWFXSjFkR0Z5YVdFeE9EQTJCZ05WQkFzTUwwRmtiV2x1YVhO
MGNtRmphY096YmlCa1pTQlQKWldkMWNtbGtZV1FnWkdVZ2JHRWdTVzVtYjNK
dFlXTnB3N051TVI4d0hRWUpLb1pJaHZjTkFRa0JGaEJoWTI5awpjMEJ6WVhR
dVoyOWlMbTE0TVNZd0pBWURWUVFKREIxQmRpNGdTR2xrWVd4bmJ5QTNOeXdn
UTI5c0xpQkhkV1Z5CmNtVnliekVPTUF3R0ExVUVFUXdGTURZek1EQXhDekFK
QmdOVkJBWVRBazFZTVJrd0Z3WURWUVFJREJCRWFYTjAKY21sMGJ5QkdaV1Js
Y21Gc01SUXdFZ1lEVlFRSERBdERkV0YxYUhURHFXMXZZekVWTUJNR0ExVUVM
Uk1NVTBGVQpPVGN3TnpBeFRrNHpNVjB3V3dZSktvWklodmNOQVFrQ0RFNVNa
WE53YjI1ellXSnNaVG9nUVdSdGFXNXBjM1J5CllXTnB3N051SUVObGJuUnlZ
V3dnWkdVZ1UyVnlkbWxqYVc5eklGUnlhV0oxZEdGeWFXOXpJR0ZzSUVOdmJu
UnkKYVdKMWVXVnVkR1V3SGhjTk1UY3dOREV3TURNMU1EQXlXaGNOTWpFd05E
RXdNRE0xTURBeVdqQ0J4akVsTUNNRwpBMVVFQXhRY1JWVkhSVTVKUVNCTVJW
UkpRMGxCSUVOQlUxUlNUeUJOVmRGUFdqRWxNQ01HQTFVRUtSUWNSVlZIClJV
NUpRU0JNUlZSSlEwbEJJRU5CVTFSU1R5Qk5WZEZQV2pFbE1DTUdBMVVFQ2hR
Y1JWVkhSVTVKUVNCTVJWUkoKUTBsQklFTkJVMVJTVHlCTlZkRlBXakVXTUJR
R0ExVUVMUk1OUTBGTlJUZ3hNRGt3TlVoS01URWJNQmtHQTFVRQpCUk1TUTBG
TlJUZ3hNRGt3TlUxT1RGTllSekF4TVJvd0dBWURWUVFMRkJGRVNWTkYwVTlU
SUVSRklFTkJVbFJQClRqQ0NBU0l3RFFZSktvWklodmNOQVFFQkJRQURnZ0VQ
QURDQ0FRb0NnZ0VCQUxqaXlaS2hWcWYzUnJaVjRFYm4KYTFtVm5ENE9NRmpX
STlQU2o3UTVqZldJZE5yN2ZuRmtlNTBOMlJxMi8yNzZFRXlXY1JjM0ZSTWtH
SUdFQWVYcQpBcDE1YzBkWnVGT3ZNRitzbnpzczZuOWRTVGdySGhZU2ZiMFRi
UGQ2aWZ6K3cvOEl0MHVKRTdnTi9abmlVUVAzClFjNDFPMXZOQjV5czh2dVZw
RUh6dzdDaGcwK1oyZk51aVpNMTZ2c2QwVmNDVUh3N1VFeFhIYWh0Z0RMSWhh
akcKbVgzb0oySFNvTWFML3o4SHduemo2UFVLRU9uRDgvY1lwZlpaWGNRMjJl
UXcwQ1ZoZnV2aEp5TDMwY2RqQUYvbwo1NkJweWMzM08ydUpISnExY3JKNnhZ
L09Nc0YrcHBHTy9oR2syTjJBRzJvc1JudW5MdWpyZ0Y2dzV2RSs2N1ltCkMx
MENBd0VBQWFNZE1Cc3dEQVlEVlIwVEFRSC9CQUl3QURBTEJnTlZIUThFQkFN
Q0JzQXdEUVlKS29aSWh2Y04KQVFFTEJRQURnZ0lCQUdhcmFZa25adDFpNndZ
ZWt5cGNJY0MwR2xnYVQ3TmFDdnBjK3pseWlSN09IcEJFQkZJLwpGanI1bFVZ
S1lnbXQvaFhWMk9NTE9ydlBzNkZTWmRiS1hlV2pNR1N1ZXc0Nm1tNHBwdDVz
cVBnc2NNRkJnTVVqCkYvS0VMUkJpMVBSTjZkbEZMMTFsRkprYnRLZWg4Y3pk
clhtUlhwSWM0dDNNeUt3K3IwUEJWZUw1c3IwS1FTRkEKY0ZscGNlTEJRTHNQ
SGRXN2tKc0FzWDlSbEs1cHA1YnBYYjhWK1VFQUNxZnNyRUhXL01ZS3hyckNh
U3NHNmo5Tgo3T0dpQzR4NFRjc2tTSXN4ZFRZWkk4N01IaVlWYVU4Z3RNRS9w
MTRFNXZ2VDZlNGdvdmFHeUtURTYyNVlqeXVsCmRzcC9MRlJrT0xkdVR1NC95
VWdoOTdwTTlOdlVCcmxLVmFuelRxRkQyUTJVb2tFSUI1bW5WVW5ScWxNRThk
c0kKcTVZNW5ibURuRThPYUIwRitNS3RVNWZyMVdjL1hOMUV0b056K2dqMDEx
VTNjZjJCaDdDdGNVN3JFRHZuL3plRgpHZmNFbU1pVnlMRW52a0ZUWlZMajRo
TTNsTWhxL0FEUko5eGwyVURGRkNvb3pJZEVjK2syclVTSVJMRzhSUVV5Ck9n
SVQ1M29Da1dFcENJZ0JsRE8yL3VhYmhZZHJ4MFltUkxvMExqaVpTQ1Q2NEpD
TVBGei82QTNwTHhlZlR2dHUKUHErd0FqN3BDRjNVYThsNU5mNkdROTZvZmJS
MDNJMnFnbktWY2FhRHRrWnB6NnNCSmttbStiSGdHVEFjaTFnbAptdnVtUkQy
U3ZUVjE2R2lwblhVUlo5NG50S3d3ODh0QkU4T3hXTktRVURQUkRWczBDbDlE
Sjl1NwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
</tns:cer>
  <tns:key>LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpQcm9jLVR5cGU6IDQs
RU5DUllQVEVECkRFSy1JbmZvOiBERVMtRURFMy1DQkMsOEIyMDQwQTE0QTdC
RDg4QQoKRlRHaEZESnhRbTltb0hvWExDNDZMVkRwVzhkRzJMTVVmTHJnSW94
Y2ZURUY0VUEwbHBKT0Zqc1ZZeXdOZm42agp0Q2xNRXFhYVNZOXV5THhXQTNB
a2MrK1pFRWdDdEhYVFY0RU9jNFlhcFlmMlZJT2p2dWdFNkVZL0FyZktMczkz
CjR4NlI3MFhzNW92NW5pb2lOT0EyQ3YzQmppYUpxVDFoalB3LzRWaks2OFgz
ZkZ3UFZEMUYxWU9oUVN2YWpyU0cKQktPQ2p5Q3hQSEx4SGU0RC85bk5Benh0
K29ZYWhaR2o3OVhpNXppOGl6eldVUWw0Y1cwTC8zOHFieFA1UmdYVQo2RXFv
UTFWaFd1azZYSU5lNi9DbkJQNUEvYXNMbTRoWXVWNzQ5YkxscGQwZWZvNkM3
bTBlVnNpM3lpR21Vc3piCmJ1bWlTYy9OeFFacUR5MHQzd3U3WWdodS93Ymdm
L0xoZERjbC9yQmprckNwZzFzNUE0UitzSUN1RXRDYkk4YUEKSk9Ha1JWRjZl
L3hnRTdXVGR5VmZ0WTlJcy9tSDlKL3plRXQxdzRCYXg3SCtpazBOTzArbzEr
cUUySmJNRlJsUgp3eVBOZ050d0twd1oyN1NlcVhDanpaalJLK1JodVlnaDRq
OFpPeE05Z2ljaXA1ajBjc05PejBuc3g1MnRINkVyCi9BYi81N3Rnaks1cnZ5
OTFRMEYxSFUxcWVxYVhxeTl3TUxHWUVxbFdJZW00amY0b2dhT3NDL1pyUTN6
elh4aFYKcHRMVXM3RU5TWExJZi85TkQ1Y05GUWpCZjNOSHA2cGlGdkIyTlNy
L3J3QW95dkFaSGphMlVJOElWeUZUT2FiNgpEVFovQXJ6VWk0dFErU1lZb3Na
UlMyM1NqZU9EOHd1OTBDVWhuSzh1MWJPZ0JERW9BeDhaZTN1ajZ6UXBhNmFa
Ckc2T2MyVkRISXQ2dStxLzlhMldCN2ZGZ1RoN3N5NTJaTHF5NFh0K3dEZ0N0
aWdzRVlIQSs1N242d2VkcHpaWmMKRkxZd3R0TzdRRDJrT0hNajRrNnVNMVFF
dEk2OExwSFpENVp5cGV4eVhxdGlKRERYVHI0U3lYaDFrS0ZqU0lwcQpyT1Nt
TmIzbUNKdHdmM1FhV2FadFVGemo0YmkwMmhRMGxpdjgxNDZCdXFNL2dXUzBr
WVRxOUhid1d6N0VrZDdkCnVnWmVzRnQ0eFNtZk9qc1Z2eSt1anlTSGQrSUkr
S3lPcTV5QzdQNDhkVDExbTVDRmJxckg3d0tWZ05Uc3I0dTAKa2QzV3RleGJz
VHcxMlBpN1o2c1IzMGt4UTdjdXlQYlNFYlh2TGhBYkRvaTc3V2crdHI4UUt5
ZzkzTktkcHdlWQpPWG1hV21lU3ZFWGExWEJEZ3I5R3FydnA3SGlPQTN0VFFt
SkhMVFdscDk2ZkdYL0J4VkhodU9jQ0JPOWtiZkllClBoZmdZRHJjalk5cjhT
OTNDZ1daamlkOWJPOTF1dnlxbFR0UlBKRFRoa0xYdEJFbTc1bE9XUWtkUUVi
UndrMVkKS0wxamJQdzlvYmpldVE4MzFreHY1S3hRK2FqSzN3cm5LNDhwUGlL
TXdUY0VUNVVjc2g0ZHFtNkpYWjk2V0FxcQp0N2N3a2lLc0Y4OXdJc2w5cXZm
YzI2NWwzSmtQSjY5bUFGandhcE9hRUJvV2I0YWdCWmRoVTh6VG5tZGt3RlZh
CjVrUitNZWxyRTJHZGYwU1RNRGhFOE9VYmNPZE82M00ydk1FSEZHMVgyWFNt
dFRhRnJVcWkxZEpQeG1DUVZ3bTgKT0FBSndlSWxaRzBKQ28wZzRuSXZBSzVH
VjBDOFl4R3QvdkRZbkNJMnlhU2hIYVR4NHl4cGd5RzFMOXk5NElRUwo2NWov
TmtJT0lCMHcwWnZKUmkyT0V1S1o4MW9pdUxPOGs0Y3B5ZE1GZERqQzdVSTU5
VlIraWxwc2ZSb3d1b2pZCmNQVUlNZUlwNWUyNHZrcGw3Qm93MTVCOVdPNUdR
TGZQM05uaDFWckZuQy8zNGJGNWJaT25VT0hrQVJZZVQxb2kKY1YxS2lmODBE
SmxxR1hhMEprS2ozc0R1WkU1REZLZS94b3N2SGtlNHZQNGRtMmlnMStycy9l
Y0Q5R3VtbkZYcAotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo=
</tns:key>
</tns:cancel></env:Body></env:Envelope>